БухЭксп/InformationRegisters/CW_ОповещенияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОповещенияКОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОповещения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОповещенияКОтправке/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассивОповещенийКОтправке() Экспорт
	
	МассивОповещений = Новый Массив;

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОповещенияКОтправке.Объект КАК Объект,
	               |	CW_ОповещенияКОтправке.ЗаголовокОповещения КАК ЗаголовокОповещения,
	               |	CW_ОповещенияКОтправке.ТекстОповещения КАК ТекстОповещения
	               |ИЗ
	               |	РегистрСведений.CW_ОповещенияКОтправке КАК CW_ОповещенияКОтправке
	               |ГДЕ
	               |	CW_ОповещенияКОтправке.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивОповещений;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОповещений.Добавить(Новый Структура("Объект,ЗаголовокОповещения,ТекстОповещения", Выборка.Объект, Выборка.ЗаголовокОповещения, Выборка.ТекстОповещения));
	КонецЦикла;
	
	//Очистим полученные записи
	Набор = РегистрыСведений.CW_ОповещенияКОтправке.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(ТекущийПользователь);
	Набор.Очистить();;
	Набор.Записать();
	
	Возврат МассивОповещений;
	
КонецФункции

Процедура ЗарегистрироватьОповещениеКОтправке(МассивОповещений) Экспорт
	
	Для Каждого ДанныеОпвещения из МассивОповещений Цикл
		
		Запись = РегистрыСведений.CW_ОповещенияКОтправке.СоздатьМенеджерЗаписи();
		Запись.Пользователь 			=  ДанныеОпвещения.Пользователь;
		Запись.Объект 					=  ДанныеОпвещения.Объект;
		Запись.ЗаголовокОповещения 		=  ДанныеОпвещения.ЗаголовокОповещения;
		Запись.ТекстОповещения 			=  ДанныеОпвещения.ТекстОповещения;
		Запись.ИдентификаторОповещения 	=  Новый УникальныйИдентификатор;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
